[
    {
        "id":1,
        "seasonId": "rfiZiUxVfB",
"season": 1,
"episodeCollection" : [
    {
        "id": 1,
        "season": 1,
        "title":"episode 1",
        "episodeId": 7317000657,
        "episodeImage":" https://occ-0-1009-2164.1.nflxso.net/dnm/api/v6/9pS1daC2n6UGc3dUogvWIPMR_OU/AAAABQyr7aU0m9aM2MOnvArV0GcMJzwZ42OW5BYA_vO1JGogq-D97nF5sZGX1kFhoetO_VzEZUKEzifLMSBZfqeeLMqFV-3EebJ1F-9zVQGrdWYr8bGhd2gdV_oC.jpg?r=75a",
       "episodeDescription" : "A boy named Eren wakes up from what feels like a long and elaborate dream. His adopted sister, Mikasa, tells him it's time to go home. She asks him why he's crying, but Eren can't remember. The year is 845 in the Shiganshina District."
       ,
       "duration":23,
       "relatedTo" :"Mikasa"
   }
       ,

       {
           "id": 2,
           "season": 1,
           "title":"episode 2",
           "episodeId": 5574080922,
           "episodeImage":"https://i0.wp.com/www.screenspy.com/wp-content/uploads/2022/07/attack-on-titan-s1-e2-2.png?ssl=1",
           "episodeDescription" : "Chaos engulfs the Shinganshina district as titans start terrorizing the city. A man continues to preach while the citizens flee toward safety. He ends up getting devoured by a titan. Eren punches and yells at Hannes for stopping him from saving his mother."
           ,
           "duration":24,
           "relatedTo":"Bertholt"
       }
          ,

          {
           "id": 3,
           "season": 1,
           "title":"episode 3",
           "episodeId": 9189151614,
           "episodeImage":"https://d2y6mqrpjbqoe6.cloudfront.net/image/upload/f_auto,q_auto/cdn1/movies-pictures/5aef03a1-0eaf-4d59-a48f-f986f1e56564.jpg",
           "episodeDescription" : "The drill instructor Keith Sadies inspects the 104th Cadet Corps recruits, hurling insults and punishments to those who give him unsatisfactory answers. Those who have witnessed the horrors from two years ago are exempt from the abuse."
           ,
           "duration":23,
           "relatedTo":"Sasha"
       }
          ,

          {
           "id": 4,
           "season": 1,
           "title":"episode 4",
           "episodeId": 8383982044,
           "episodeImage":"https://i0.wp.com/www.screenspy.com/wp-content/uploads/2022/07/attack-on-titan-s1-e4-6.png?fit=800%2C440&ssl=1",
           "episodeDescription" : "Everyone is surprised at Eren's choice to join the Scouts despite his standing. One of them tells him humanity can't defeat titans. Eren admits they're losing, but only because they lack information. He swears on his dream to drive out all of the titans from the walls."
           ,
           "duration":26,
           "relatedTo":"Armin"
       }
          ,


          {
           "id": 5,
           "season": 1,
           "title":"episode 5",
           "episodeId": 5863775247,
           "episodeImage":"https://d2y6mqrpjbqoe6.cloudfront.net/image/upload/f_auto,q_auto/cdn1/movies-pictures/68f5c8cf-5e2c-428f-b474-ab2ae681003a.jpg",
           "episodeDescription" : "Eren runs toward the Colossal Titan, who now manages to smash through the cannons on the gate. Seeing how the creature deliberately kicked down the door, he knows this is something with intelligence.Eren makes his way through its arm, back, and towards the weak spot which is at the nape of the neck. The titan blows a smokescreen from its back to slow him down and disappears completely, causing Eren’s blow to whiff. The Colossal Titan Response squad now arrives at their location, and he and Connie are called to move back to report on the event."
    
           ,
           "duration":28,
           "relatedTo":"Armin"
       }
          ,

          {
           "id": 6,
           "season": 1,
           "title":"episode 6",
           "episodeId": 4029250115,
           "episodeImage":"https://m.media-amazon.com/images/M/MV5BM2NjNmY0NTktZmQzZi00M2IwLWI5ODAtYmU5MjE0M2FjZDlkXkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_.jpg",
          "episodeDescription" : "Armin apologizes and returns to the rearguard while Connie and his squad move forward. Suddenly, the reality of this world dawns on Armin, where the strong defeat the weak. Now that his friend is gone, the one that always protected him from his frailty, he feels guilt and regret."
          ,
       "duration":25,
       "relatedTo" :"Mikasa"
       }
          ,

          {
              "id": 7,
              "season": 1,
              "title":"episode 7",
              "episodeId": 2705790873,
              "episodeImage":"https://i0.wp.com/www.screenspy.com/wp-content/uploads/2022/07/attack-on-titan-s1-e7-3.png?ssl=1",
              "episodeDescription" : "Jean and Connie's squad are now trapped, unable to reach safety without a resupply of gas. Connie tells the despondent Jean that they should fight for it or die from the titans, but Jean doesn't think they can manage it with only cadets and no veterans at their side."
              ,
              "duration":28,
              "relatedTo":"Jean"
           }
             ,

             {
              "id": 8,
              "season": 1,
              "title":"episode 8",
              "episodeId": 3245623362,
              "episodeImage":"https://animeaudiolog.files.wordpress.com/2013/05/shingeki-no-kyojin-episode-8-erens-return.jpg",
              "episodeDescription" : "Jean and his crew find rifles inside the facility and plan to use them against the titans. Armin thinks it's enough to defeat the three-meter titans wandering the halls. They can shoot the titans inside by crowding the lift and lowering them while others attack from behind."
              ,
              "duration":24,
              "relatedTo":"Eren"
           }
             ,

             {
              "id": 9,
              "season": 1,
              "title":"episode 9",
              "episodeId": 5917665712
              ,
              "episodeImage":"https://i0.wp.com/www.screenspy.com/wp-content/uploads/2022/07/attack-on-titan-s1-e9-4.png?fit=800%2C440&ssl=1",
              "episodeDescription" : "Captain Levi takes out several titans singlehandedly in one of the fallen towns. He saves one of the scouts, but the victim's wounds prove fatal. Levi tells him he's done his part and promises that he'll put an end to the titans. The man dies with relief on his face."
              ,
              "duration":25,
              "relatedTo":"Eren"
           }
             ,

             {
              "id": 10,
              "season": 1,
              "title":"episode 10",
              "episodeId": 9544270475 ,
              "episodeImage":"https://i.ytimg.com/vi/rWIxpK3Iry8/maxresdefault.jpg",
              "episodeDescription" : "Captain Kitz remains indecisive on what to do after the cannons have been reloaded, so Armin formulates a plan. He knows the tendency of his friends to act recklessly and accounts for it. Eren then tells Armin to try and convince the garrison that they can use Eren's powers, as only he can persuade them to do so."
              ,
              "duration":33,
              "relatedTo":"Mikasa"
           }
             ,

             {
               "id": 11,
               "season": 1,
               "title":"episode 11",
               "episodeId": 3729089728,
               "episodeImage":"https://derf9v1xhwwx1.cloudfront.net/image/upload/oth/FunimationStoreFront/V1686042/artwork/81e2e915-7416-4278-b64b-fbec4bfc8754_keyartofficialvideoimage.jpg",
              "episodeDescription" : "Pyxis readies his elite squad to assist Eren, but the three of them express doubt in the uncertainty of his powers. Pyxis tells them he's tired of losing and wants every advantage he can take, even if it's a gamble."
              ,
              "duration":30,
              "relatedTo":"Eren"
           }
              ,
  
              {
                  "id": 12,
                  "season": 1,
                  "title":"episode 12",
                  "episodeId": 5842066901,
                  "episodeImage":"https://i0.wp.com/www.screenspy.com/wp-content/uploads/2022/07/attack-on-titan-s1-e12-7.png?ssl=1",
                  "episodeDescription" : "The plan to reclaim Trost falls apart when Eren's newfound powers turn him into a mindless giant. As Titans continue to swarm the city, it's up to Armin and Mikasa to make sure the cadets massacred during the mission haven't died in vain."
                  ,
                  "duration":44,
                  "relatedTo":"Jean"
               }
 
]
    },

    {
        "id":2,
        "seasonId": "rfiZiUxVfB",
"season": 2,
"episodeCollection" : [
    {
        "id": 13,
        "season": 2,
        "episodeId": 7937590968,
        "title":"episode 1",
        "episodeImage":"https://m.media-amazon.com/images/M/MV5BMjA5YmMyMDctZWVhMi00ODY5LWI2YjAtNmMzNmRiYzkzNmI4XkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_.jpg",
        "episodeDescription" : "Down on the field, Hitch and Marlo survey the wreckage brought on Stohess, and question why there's no official word on the incident yet. After covering the titan, Hange asks Pastor Nick why they kept the wall titans a secret after all this time. He ignores her question and requests to be escorted back down."
        ,
        "duration":28,
        "relatedTo":"Zeke"
     }
       ,

       {
        "id": 14,
        "season": 2,
        "episodeId": 6742066901
        ,
        "title":"episode 2",
        "episodeImage":"https://d2y6mqrpjbqoe6.cloudfront.net/image/upload/f_auto,q_auto/cdn1/movies-pictures/ec87bf90-4488-4649-84ef-0711f1ce6944.jpg",
        "episodeDescription" : "Hange joins Eren, Armin, and Mikasa in their carriage alongside Levi and Pastor Nick. As they leave, Armin thinks about how the titans themselves could be protecting them from other titans. Later, Hange reveals that Pastor Nick is aware of the titans within the walls, but he wouldn't divulge their secrets."
        ,
        "duration":30,
        "relatedTo":"Sasha"
     }
       ,


       {
        "id": 15,
        "episodeId": 3303744173,
        "season": 2,
        "title":"episode 3",
        "episodeImage":"https://i0.wp.com/100wordanime.blog/wp-content/uploads/2017/04/titans2e3b.jpg?fit=648%2C362&ssl=1",
        "episodeDescription" : "In this episode of Attack on Titan, Connie comes home to what’s essentially a ghost town, Christa and Ymir have a little moment in which something seemingly huge to the plot gets revealed, and Pastor Nick finally grows a very tiny set of balls to clue the Survey Corp in just enough about what is actually going on so our heroes can get out of the limbo the next episode."
        ,
        "duration":23,
        "relatedTo":"Connie"
     }
       ,

       {
         "id": 16,
         "episodeId": 7451497724,
         "season": 2,
         "title":"episode 4",
         "episodeImage":"https://i0.wp.com/www.screenspy.com/wp-content/uploads/2022/06/Screenshotter-AttackonTitanE29Soldier-306.jpg?ssl=1",
         "episodeDescription" : "Historia and the others witness their deaths and feel the frustration and helplessness of having no means to fight. Ymir reprimands Christa for her selfless, heroic tendencies, so he asks for Connie's knife and volunteers to fight with it."
         ,
         "duration":27,
         "relatedTo":"Ymir"
     }
        ,

        {
         "id": 17,
         "episodeId": 6704252075,
         "season": 2,
         "title":"episode 5",
         "episodeImage":"https://4geekslikeyou.com/wp-content/uploads/2017/05/img_2610.jpg",
         "episodeDescription" : "Reiner catches Christa from her fall and asks if she knew she was a titan, but Christa denies it. The three boys suggest Ymir might know something about the enemy. Ymir continues to fight outnumbered but eventually gets caught and surrounded."
         ,
         "duration":26,
         "relatedTo":"Ymir"

     }
        ,

        {
         "id": 18,
         "episodeId": 9399103560,
         "season": 2,
         "title":"episode 6",
         "episodeImage":"https://sm.ign.com/ign_in/review/a/attack-on-/attack-on-titan-episode-31-warrior-review_afbt.jpg",
         "episodeDescription" : "After surviving the horrors of Utgard Castle, Reiner's group re-joins the Survey Corps on top of the wall to assess their objectives. However, on top of that wall, a startling revelation is made. One that will forever change the battle between humanity and the Titans."
         ,
         "duration":25,
         "relatedTo":"Bertholt"
     }
        ,

        {
         "id": 19,
         "episodeId": 1118137645,
         "season": 2,
         "title":"episode 7",
         "episodeImage":"https://i.ytimg.com/vi/4cf_UJnjFPM/maxresdefault.jpg",
         "episodeDescription" : "Eren transforms and smashes into Reiner as they fall from the wall. Mikasa looks at her two enemies, regretting she couldn’t cut off their heads. The Colossal Titan pushes against Hange’s squad and puts Ymir in his mouth. Hange orders her troops to defeat the enemy and surround him. They find that the Colossal’s movements are slow, just as the reports stated. But as they approach the nape, the Titan emits a strong gust of steam that pushes everyone away."
         ,
         "duration":24,
         "relatedTo":"Zeke"
     }
        ,

        {
         "id": 20,
         "episodeId": 5055131043,
         "season": 2,
         "title":"episode 8",
         "episodeImage":"https://m.media-amazon.com/images/M/MV5BNDlhZWZhODAtOTExNS00YjE4LWE1ZTAtMjFjYjg1YmJjN2UzXkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_.jpg",
         "episodeDescription" : "We left off last week with Eren gaining the upperhand in his fight against the Armored Titan when the Colossal Titan (or his ginormous torso) decided to fall on them, and we picked up this week with Bertolt and Reiner kidnapping both Eren and Ymir, leaving the rest of the Survey Corps defeated and unable to follow."
         ,
         "duration":27,
         "relatedTo":"Mikasa"
     }
        ,

        {
         "id": 21,
         "episodeId": 8125249758,
         "season": 2,
         "title":"episode 9",
         "episodeImage":"https://pogd.es/assets/episodes/Attack-on-Titan/Attack-on-Titan-S02E04-763d6794cb65c97eef0b5dbeaca30d82-thumb.jpg",
         "episodeDescription" : "This episode picks up where we last left off. Eren finds that he has been left without his arms from the last battle, while Ymir has already been conscious and just now beginning to heal. Eren asks her what happened to him, Reiner responding that he was the one responsible."
         ,
         "duration":24,
         "relatedTo":"Reiner"
     }
        ,

        {
         "id": 22,
         "episodeId": 7317239624,
         "season": 2,
         "title":"episode 10",
         "episodeImage":"https://m.media-amazon.com/images/M/MV5BZDZiMDc0NTUtYTM4NC00OTUwLThlNjYtMWEwY2U1MzNmNzcwXkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_.jpg",
         "episodeDescription" : "From Eren's perspective, we learn that Ymir has been living as a Titan for 60 years right before he passes out. With Eren restrained, they all flee from the tree tops with the Scouts close behind. While fleeing, Ymir finally realizes that the scouts are pursuing them to rescue both her and Eren."
         ,
         "duration":25,
         "relatedTo":"Ymir"
     }
        ,

        {
         "id": 23,
         "episodeId": 3533513022,
         "season": 2,
         "title":"episode 11",
         "episodeImage":"https://otakuorbit.com/wp-content/uploads/2017/06/at11.jpg?w=700",
         "episodeDescription" : "Summary. Ymir escapes the Forest of Giant Trees carrying Historia in her Titan's mouth. When Ymir nears the edge of the forest, Reiner transforms into the Armored Titan and begins their escape. Bertholdt carrying an unconscious Eren grapples onto the Armored Titan's back alongside Ymir's Titan."
         ,
         "duration":33,
         "relatedTo":"Historia"
     }
        ,

        {
         "id": 24,
         "episodeId": 901976905,
         "season": 2,
         "title":"episode 12",
         "episodeImage":"https://otakuorbit.com/wp-content/uploads/2017/06/aot677.jpg?w=700",
         "episodeDescription" : "Eren uses his newfound power to immediately get his revenge on the Smiling Titan, making all of the other Titans attack and eat it. Reiner and Bertolt – and Ymir to a lesser extent – also are affected by Eren's new abilities and forced to retreat. Ymir goes to help them, and the three end up on the wall, still alive."
         ,
         "duration":47,
         "relatedTo":"Eren"
     }
       
]
    },

    {
        "id":3,
        "seasonId": "rfiZiUxVfB",
"season": 3,
"episodeCollection" : [
    {
        "id": 25,
        "episodeId": 5450863192,
        "season": 3,
        "title":"episode 1",
        "episodeImage":"https://i0.wp.com/film-bunker.com/wp-content/uploads/2018/08/MV5BNTAyZWQ0YjYtZDM4OS00NGU0LWJmZGMtMzBmZmRmNzA3MTVhXkEyXkFqcGdeQXVyMzExMzk5MTQ@._V1_.jpg?fit=1280%2C719&ssl=1",
        "episodeDescription" : "Rescue. Levi and the rogue scouts walk the streets of Trost on the day of the anniversary of the Kings Coronation. Nearby, police gather the citizens to hand out free rations. Suddenly, a wagon arrives, abducting Eren and Historia, but they are body doubles played by Armin and Jean."
        ,
        "duration":30,
        "relatedTo":"Levi"
    }
       ,

       {
        "id": 26,
        "episodeId": 4583999126,
        "season": 3,
        "title":"episode 2",
        "episodeImage":"https://otakuorbit.com/wp-content/uploads/2018/07/lv1.png?w=1024",
        "episodeDescription" : "The episode picks up on the climactic fight between Levi and Kenny the Ripper that ended the previous entry. Levi faces a large amount of pressure to not only be able to stand up to this intimidating figure from his past, but to also keep his team safe and protect Eren and Historia from the enemy."
        ,
        "duration":24,
        "relatedTo":"Levi"
    }
       ,

       {
        "id": 27,
        "episodeId": 6497032421,
        "season": 3,
        "title":"episode 3",
        "episodeImage":"https://i0.wp.com/otakuorbit.com/wp-content/uploads/2018/08/historia.png?ssl=1",
        "episodeDescription" : "This sad history covers the series of events that lead to Historia's pseudonym of Christa Lenz and why she's been separated from her father for so long. Once Rod speaks to Historia's royal lineage and the importance of her family, it becomes clear why they were so determined to kidnap her"
        ,
        "duration":30,
        "relatedTo":"Historia"
    }
       ,

       {
        "id": 28,
        "episodeId": 1541608206,
        "season": 3,
        "title":"episode 4",
        "episodeImage":"https://preview.redd.it/26vc66d8xce11.jpg?width=1920&format=pjpg&auto=webp&s=f6fca27564f31bed422536617939a760ea4cb49e",
        "episodeDescription" : "Hange saves Reeves' son Flegel from being pursued by the Military Police. She wants to use his witness account to exonerate the Scouts, but the influence of the Interior Police proves too much for him. Still, his only safe alternative is to run and hide, so Hange forces him to follow her plan."
        ,
        "duration":28
        ,
        "relatedTo":"Levi"
    }
       ,

       {
        "id": 29,
        "episodeId": 4727981131,
        "season": 3,
        "title":"episode 5",
        "episodeImage":"https://otakuorbit.com/wp-content/uploads/2018/08/aot-ep-5-3.png?w=1024",
        "episodeDescription" : "Erwin proves victorious in his coup, but admits that the fight from here on out isn't easy. Hange and Moblit reach Levi's squad with news of the successful coup. Flegel was the key to proving the scouts are innocent. They are now free, but parts of the Interior Police and Eren's whereabouts are still unknown."
        ,
        "duration":26,
        "relatedTo":"Eren"

    }
       ,

       {
        "id": 30,
        "episodeId": 5999809424,
        "season": 3,
        "title":"episode 6",
        "episodeImage":"https://omnitos.com/wp-content/uploads/2018/08/img_20180823_1531581620059051.jpg",
        "episodeDescription" : "Eren's rampage is thwarted by the War Hammer Titan whose tenacity leaves him stumped. With Marley's military joining the fight, he'll be hard-pressed to survive on his own."
        ,
        "duration":27,
        "relatedTo":"Eren"

    }
       ,


       {
        "id": 31,
        "episodeId": 1881907980,
        "season": 3,
        "title":"episode 7",
        "episodeImage":"https://i0.wp.com/otakuorbit.com/wp-content/uploads/2018/09/sin-snk-1.png?ssl=1",
        "episodeDescription" : "Levi manages to wound Kenny non-fatally while Hange is taken out of the fight by Kenny's Dragon. Rod further persuades Historia into eating Eren so royal blood can regain his stolen power- Kenny reveals his true colors and gives Eren the means to fight back, who refuses."
        ,
        "duration":28,
        "relatedTo":"Historia"

    }
       ,

       {
        "id": 32,
        "episodeId": 3078699452,
        "season": 3,
        "title":"episode 8",
        "episodeImage":"https://i0.wp.com/omnigeekempire.com/wp-content/uploads/2018/09/aot111222212-e1536522092370.png?resize=1140%2C641&ssl=1",
        "episodeDescription" : "Levi's squad finds themselves blocked from moving into the inner cavern when they see the bright light brought by Rod Reiss' transformation. The cavern pillars start crumbling, putting everyone inside at risk. Armin finds a small opening near him, so Levi calls for him and Moblit to escape carrying Hange."
        ,
        "duration":30,
        "relatedTo":"Eren"

    }
       ,

       {
        "id": 33,
        "episodeId": 1464028602,
        "season": 3,
        "title":"episode 9",
        "episodeImage":"https://i0.wp.com/omnigeekempire.com/wp-content/uploads/2018/09/aot-titan1-e1537128124181.png?fit=1920%2C1080&ssl=1",
        "episodeDescription" : "Desperate to stop the approaching monstrosity, the Scouts resort to unconventional tactics before it destroys everything in its path. Desperate to stop the approaching monstrosity, the Scouts resort to unconventional tactics before it destroys everything in its path."
        ,
        "duration":22,
        "relatedTo":"Connie"
    }
       ,

       {
        "id": 34,
        "episodeId": 4001506872,
        "season": 3,
        "title":"episode 10",
        "episodeImage":"https://omnitos.com/wp-content/uploads/2018/09/img_20180922_2131161956712712.jpg",
        "episodeDescription" : "One day, Kenny sought out his dying sister Kuchel who works for a brothel in the underground. There, he meets his nephew who turns out to be Levi. Kenny is forced to care for Levi, but he can't act as a father. He taught him how to use a knife so he could survive underground."
        ,
        "duration":24,
        "relatedTo":"Armin"
    }
       ,

       {
        "id": 35,
        "episodeId": 6186671469,
        "season": 3,
        "title":"episode 11",
        "episodeImage":"https://pictures.betaseries.com/banners/episodes/6563/84e66a2d49098b0c96d5af46368f47c6.jpg",
        "episodeDescription" : "Grisha decides to be a doctor inside the walls, and wants to learn everything about their society with Sadies. Grisha notes that there's relative peace inside the walls, but Sadies argues that it isn't enough. As a scout who yearns for freedom outside, Grisha calls Sadies a chosen one."
        ,
        "duration":30,
        "relatedTo":"Eren"
    }
       ,

       {
        "id": 36,
        "episodeId": 1391761331,
        "season": 3,
        "title":"episode 12",
        "episodeImage":"https://www.denofgeek.com/wp-content/uploads/2018/10/attack_on_titan_312-2.jpg",
        "episodeDescription" : "Armin remembers their dream of exploring the sea and all the wondrous lands outside of the walls. He invites Eren to see it once everything boils over. The next day, the scouts prepare to take back Wall Maria with the citizens cheering them on to reclaim their land. The scouts have never had a warm send out like this."
        ,
        "duration":45,
        "relatedTo":"Sasha"
    }
       

]
    },

    {
        "id":4,
        "seasonId": "rfiZiUxVfB",
"season": 4,
"episodeCollection" : [
    {
        "id": 37,
        "episodeId": 3912850051,
        "season": 4,
        "title":"episode 1",
        "episodeImage":"https://i.pinimg.com/originals/31/ed/84/31ed842ac90a53a68e47f7f2424c7604.jpg",
        "episodeDescription" : "Set sometime after Season 3, Episode 1 of Season 4 follows a group of mainland Eldian soldiers fighting the final battle in Marley's war against the Mid-East Allied Forces, also known as the Mid-East Alliance. The protagonist of this episode, Falco, is a candidate for being one of Marley's next Titan Shifters"
        ,
        "duration":30, 
        "relatedTo":"Gabby"
    }
       ,

       {
        "id": 38,
        "episodeId": 1884673532,
        "season": 4,
        "title":"episode 2",
        "episodeImage":"https://film-book.com/wp-content/uploads/2021/12/attack-on-titan-season-four-part-two-01-700x400-1-700x400.jpg",
        "episodeDescription" : "The episode starts off with Marley officials and Zeke discussing the outcome of their victory against the Middle East forces. Despite winning the battle, they are still at a disadvantage after the enemy forces gained upperhand in developing anti titan weapons. Marley only have the titans to rely on which are indisputably better at land combat.To counter the negative impression, Zeke suggested to device a plan to recover the founding titan in his last year. He proposed that the next headline should read that the Marley forces have occupied Paradis and gained the power of all titans. This is were the anime cutoff the dialogue where Zeke mentioned his father, Grisha Yaeger and how he got the attack titan."
        ,
        "duration":23,
        "relatedTo":"Levi"
    }
       ,


       {
        "id": 39,
        "episodeId": 4897532032,
        "season": 4,
        "title":"episode 3",
        "episodeImage":"https://thecinemaholic.com/wp-content/uploads/2020/12/Screenshot-2020-12-21-at-3.49.55-PM.png",
        "episodeDescription" : "Rainier is saved from suicide by a revelation. Reiner puts a rifle barrel on his mouth, ready to end his life here and now. After lying his way through his struggles and bearing the guilt of the sins he has committed against his Warrior and Paradis friends, he makes himself vanish. Only for something to stop him."
        ,
        "duration":27,
        "relatedTo":"Eren"
    }
       ,


       {
        "id": 40,
        "episodeId": 9985846534,
        "season": 4,
        "title":"episode 4",
        "episodeImage":"https://imgix.bustle.com/uploads/image/2022/1/26/8d19958d-687b-40ab-8cf8-8f5c350bb2db-aot-two-people.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg",
        "episodeDescription" : "https://imgix.bustle.com/uploads/image/2022/1/26/8d19958d-687b-40ab-8cf8-8f5c350bb2db-aot-two-people.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg"
        ,
        "duration":28,
        "relatedTo":"Zeke"
    }
       ,


       {
        "id": 41,
        "episodeId": 7593584368,
        "season": 4,
        "title":"episode 5",
        "episodeImage":"https://i.ytimg.com/vi/CoRDrEFNMxM/maxresdefault.jpg",
        "episodeDescription" : "Willy combs through his revelation that Marleyan history on the glory of Helos is all a lie and that King Fritz is actually a savior, not a villain. Willy goes on to explain that Fritz promised to not subject Marley to the Founding Titan if these two nations could find a way to live in peace and abolish war."
        ,
        "duration":29,
        "relatedTo":"Gabby"
    }
       ,

       {
        "id": 42,
        "episodeId": 6222415265,
        "season": 4,
        "title":"episode 6",
        "episodeImage":"https://d.newsweek.com/en/full/1702195/attack-titan-final-season-4-visual.jpg?w=1600&h=900&q=88&f=a7bf09f162094f2b2c05cb2a6ae8e910",
        "episodeDescription" : "Eren's rampage is thwarted by the War Hammer Titan whose tenacity leaves him stumped; with Marley's military joining the fight, he'll be hard-pressed to survive on his own."
        ,
        "duration":26,
        "relatedTo":"Mikasa"
    }
       ,


       {
        "id": 43,
        "episodeId": 7890210415,
        "season": 4,
        "title":"episode 7",
        "episodeImage":"https://cdn.epicstream.com/images/ncavvykf/epicstream/934d598049601c92421712433fe5642c9f31f8fa-1920x1080.png?rect=0,60,1920,960&w=1200&h=600&auto=format",
        "episodeDescription" : "As the battle between Eren and the warriors rages on, another party makes their move on Marley's Forces that pushes the tide of the battle into a more devastating climax."
        ,
        "duration":25,
        "relatedTo":"Jean"
    }
       ,


       {
        "id": 44,
        "episodeId": 6509144362,
        "season": 4,
        "title":"episode 8",
        "episodeImage":"https://www.cbr.com/wp-content/uploads/2021/02/maxresdefault-1.jpg",
        "episodeDescription" : "Through his mother's death, Eren's desire for freedom grew into an unquenchable flame. Gabi renewed her idealism to restore the image of 'good Eldians' as she assaults the airship with a rifle ready for the kill. However, Falco's encounter with Eren allowed him to see that he and Paradis suffered because of Marley."
        ,
        "duration":23,
        "relatedTo":"Sasha"
    }
       ,
       
       
       {
        "id": 45,
        "episodeId": 9809077910,
        "season": 4,
        "title":"episode 9",
        "episodeImage":"https://cdn.aniblogtracker.com/live/20210201/1612146459.2971.25144.jpg",
        "episodeDescription" : " Yelena proves that she's already willing to kill for Eren, but it's enlightening to hear her explain her reverence towards seeing Zeke's Beast Titan for the first time. She reveres the monster as a God."
    ,
    "duration":24,
    "relatedTo":"Zeke"
    }
       ,

       {
        "id": 46,
        "episodeId": 1788323765,
        "season": 4,
        "title":"episode 10",
        "episodeImage":"https://fossbytes.com/wp-content/uploads/2022/03/FotoJet-17-compressed.jpg",
        "episodeDescription" : "We see Eren's change through a series of flashbacks from two years back, recalling the Azumabito alliance, Historia's pregnancy and the railroad scene, where Eren shares one last pleasant moment with his friends before he heads for Marley and to doom the world that threatens what he loves."
    ,
    "duration":26,
    "relatedTo":"Connie"
    }
       ,


       {
        "id": 47,
        "episodeId": 5469920926,
        "season": 4,
        "title":"episode 11",
        "episodeImage":"https://www.denofgeek.com/wp-content/uploads/2021/02/Attack-On-Titan-Season-4-Episode-11-Gabi-Horse.jpg?fit=1200%2C675",
        "episodeDescription" : "“Counterfeit” features Gabi and Falco on the run as they trek back towards Marley. The duo experiences a more human side of the so-called Eldian devils when a kind family gives them shelter and shows them hospitality.",
        "duration":28,
        "relatedTo":"Gabby"
    }
       ,


       {
        "id": 48,
        "episodeId": 5487292314,
        "season": 4,
        "title":"episode 12",
        "episodeImage":"https://www.leisurebyte.com/wp-content/uploads/2022/04/Screenshot-4944.jpg",
        "episodeDescription" : "Mikasa and Armin were on edge as they witnessed the lead-up to the Yeagerist revolt. After their visit to Zackly's office, they see some officers from the military, confirming that they will decide to take away Eren's Titan powers. Before Mikasa could barge in to appeal for Eren once more, Armin stops her.",
       "duration":47,
       "relatedTo":"Mikasa"
    }
]
    }

]